inputs/templates/molokai_laminar/constant/polyMesh/blockMeshDict.org
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(

    // Inlet Relxation zone
    (0   -25 0) // v0
    (2000 -25 0) // v1
    (2000 7 0)  // v2
    (0   7 0)  // v3

    (0   -25 0.1) // v4
    (2000 -25 0.1) // v5
    (2000 7  0.1)  // v6
    (0   7 0.1)  // v7

);

blocks
(
    hex (0 1 2 3 4 5 6 7) ({{ n_x_cells }} {{ n_y_cells }} 1) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (3 2 6 7)        // inlet block top
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
        );
    }
);
mergePatchPairs
(
);